[
  {
    "id": "1",
    "title": "App Launch",
    "slug": "app-launch",
    "excerpt": "A comprehensive launch platform for modern web applications, featuring automated deployments and analytics.",
    "description": "App Launch is a full-stack solution designed to streamline the deployment process for developers. Built with React and Node.js, it integrates seamlessly with major cloud providers to offer one-click deployments.\n\nThe platform includes a real-time analytics dashboard powered by WebSockets, giving users instant feedback on their application's performance and user engagement. The architecture relies on a microservices approach, ensuring scalability and reliability under high load.",
    "tags": ["React", "Next.js", "Node.js"],
    "date": "Oct 2025",
    "link": "https://example.com",
    "repo": "https://github.com/example/app-launch",
    "image": "/assets/workone.jpg"
  },
  {
    "id": "2",
    "title": "E-commerce Platform",
    "slug": "ecommerce-platform",
    "excerpt": "A scalable, high-performance e-commerce solution optimized for conversion and user experience.",
    "description": "This project is a headless e-commerce platform built to handle high traffic volumes while maintaining sub-second load times. It leverages Next.js for server-side rendering and static generation, ensuring optimal SEO and performance.\n\nThe backend is powered by a custom Node.js API that manages inventory, orders, and payments. We integrated Stripe for secure payment processing and a custom admin panel for effortless product management.",
    "tags": ["TypeScript", "Next.js", "Tailwind"],
    "date": "Sep 2025",
    "link": "https://example.com",
    "repo": "https://github.com/example/ecommerce",
    "image": "/assets/worktwo.jpg"
  },
  {
    "id": "3",
    "title": "Portfolio v1",
    "slug": "portfolio-v1",
    "excerpt": "My first portfolio website. A minimalist design focused on typography and whitespace.",
    "description": "Reflecting on my journey, Portfolio v1 was an exercise in restraint. I wanted to create a space that felt calm and focused, allowing the work to speak for itself.\n\nBuilt with plain HTML, CSS, and vanilla JavaScript, it taught me the fundamentals of web design and accessibility. While simple, it laid the groundwork for my understanding of layout and visual hierarchy.",
    "tags": ["HTML", "CSS", "JS"],
    "date": "Aug 2024",
    "link": "https://example.com",
    "repo": "https://github.com/example/portfolio-v1",
    "image": "/assets/design-mock.jpg"
  },
  {
    "id": "4",
    "title": "Weather App",
    "slug": "weather-app",
    "excerpt": "A beautiful, minimalist weather dashboard that makes checking the forecast a delight.",
    "description": "Tired of cluttered weather apps, I built this dashboard to provide essential information at a glance. It uses the OpenWeatherMap API to fetch real-time data and forecasts.\n\nThe UI is fully responsive and features dynamic background animations that change based on the current weather conditions, created with Framer Motion. It creates an immersive experience that goes beyond simple data display.",
    "tags": ["React", "API", "Framer Motion"],
    "date": "Jul 2025",
    "link": "https://example.com",
    "repo": "https://github.com/example/weather-app",
    "image": "/assets/design-mock.jpg"
  }
]
